package ex05;

/**
 * Інтерфейс черги завдань (шаблон Worker Thread).
 * <p>
 * Визначає методи для додавання та вилучення завдань з черги.
 * </p>
 * 
 * @author Сизоненко Нікіта
 * @version 1.0
 */
public interface Queue {
    
    /**
     * Додає нове завдання до черги.
     * 
     * @param cmd завдання для виконання
     */
    void put(Command cmd);
    
    /**
     * Вилучає завдання з черги для виконання.
     * Якщо черга порожня, очікує на появу завдання.
     * 
     * @return завдання для виконання
     */
    Command take();
}